Add mermaid, and sate a linter
Signed-off-by: Rick Elrod <rick@elrod.me>
